tap "adoptopenjdk/openjdk"
tap "bramstein/webfonttools"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
brew "ack"
brew "aircrack-ng"
brew "bfg"
brew "binutils"
brew "p7zip"
brew "xz"
brew "python"
brew "binwalk"
brew "cifer"
brew "cmake"
brew "coreutils"
brew "cowsay"
brew "dark-mode"
brew "dex2jar"
brew "diff-so-fancy"
brew "dns2tcp"
brew "elinks"
brew "fcrackzip"
brew "findutils"
brew "foremost"
brew "fortune"
brew "git"
brew "git-extras"
brew "git-flow"
brew "git-lfs"
brew "libffi"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "hashpump"
brew "lua"
brew "htop"
brew "hub"
brew "hydra"
brew "imagemagick"
brew "jenv"
brew "john"
brew "knock"
brew "luarocks"
brew "lynx"
brew "moreutils"
brew "n"
brew "neofetch"
brew "neovim"
brew "netpbm"
brew "ngrep"
brew "nmap"
brew "node", link: false
brew "openconnect"
brew "pandoc"
brew "pigz"
brew "pinentry-mac"
brew "pkg-config"
brew "pngcheck"
brew "pv"
brew "python@2"
brew "ruby-build"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "rename"
brew "rhino"
brew "rpm"
brew "ruby"
brew "socat"
brew "speedtest-cli"
brew "sqlmap"
brew "ssh-copy-id"
brew "tcpflow"
brew "tcpreplay"
brew "tcptrace"
brew "tmux"
brew "tokei"
brew "tree"
brew "ucspi-tcp"
brew "vim"
brew "watchman"
brew "webkit2png"
brew "wget"
brew "woff2"
brew "yarn"
brew "zopfli"
brew "zsh"
brew "bramstein/webfonttools/sfnt2woff"
brew "bramstein/webfonttools/sfnt2woff-zopfli"
brew "heroku/brew/heroku"
cask "adoptopenjdk8"
cask "appcleaner"
cask "betterzip"
cask "caffeine"
cask "cheatsheet"
cask "dropbox"
cask "insomnia"
cask "iterm2"
cask "java"
cask "mactex"
cask "mongodb"
cask "postman"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklookase"
cask "slack"
cask "spectacle"
cask "spotify"
cask "spotify-notifications"
cask "suspicious-package"
cask "the-unarchiver"
cask "transmission"
cask "virtualbox"
cask "vlc"
cask "vscodium"
cask "webpquicklook"
cask "adoptopenjdk/openjdk/adoptopenjdk11"
cask "caskroom/fonts/font-hack-nerd-font"
