tap "caskroom/fonts"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
brew "ack"
brew "coreutils"
brew "cowsay"
brew "elinks"
brew "fortune"
brew "git"
brew "htop"
brew "python", link: false
brew "gnupg"
brew "go"
brew "luarocks"
brew "mongodb"
brew "n"
brew "neofetch"
brew "neovim"
brew "nmap"
brew "openconnect"
brew "pinentry-mac"
brew "reattach-to-user-namespace"
brew "rpm"
brew "tmux"
brew "tokei"
brew "tree"
brew "watchman"
brew "wget"
brew "yarn"
brew "zsh"
brew "heroku/brew/heroku"
cask "alfred"
cask "cheatsheet"
cask "dropbox"
cask "google-chrome"
cask "iterm2"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "slack"
cask "spectacle"
cask "spotify"
cask "spotify-notifications"
cask "suspicious-package"
cask "the-unarchiver"
cask "transmission"
cask "virtualbox"
cask "vlc"
cask "vscodium"
cask "webpquicklook"
cask "caskroom/fonts/font-hack-nerd-font"
