# specify a directory to install
cask_args appdir: "~/Applications"

# Install GNU core utilities (those that come with OS X are outdated).
# Don't forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
brew "coreutils"
#sudo ln -s /usr/local/bin/gsha256sum /usr/local/bin/sha256sum

# Install some other useful utilities like `sponge`.
brew "moreutils"
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew "findutils"
# Install GNU `sed`, overwriting the built-in `sed`.
brew "gnu-sed"
# Install `wget`
brew "wget"

# Install Python
brew "python", link: false
brew "python3"

# Install ruby-build and rbenv
brew "ruby-build"
#brew "rbenv"

#tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "adoptopenjdk/openjdk"

## Install font tools.

tap "bramstein/webfonttools"
tap "caskroom/fonts"

brew "ack"
brew "bandwhich"
brew "sfnt2woff"
brew "sfnt2woff-zopfli"
brew "woff2"
brew "diff-so-fancy"
brew "exa"
brew "fd"
brew "git-crypt"
brew "git-extras"
brew "git-lfs"
brew "git"
brew "gnupg"
brew "guoxbin/guoxbin/dtool"
brew "highlight"
brew "htop"
brew "hyperfine"
brew "jenv"
brew "luarocks"
brew "lynx"
brew "n"
brew "neofetch"
brew "neovim"
brew "ngrep"
brew "nmap"
brew "onefetch"
brew "openconnect"
brew "pandoc"
brew "pinentry-mac"
brew "pv"
brew "reattach-to-user-namespace"
brew "rename"
brew "romkatv/powerlevel10k/powerlevel10k"
brew "rpm"
brew "ruby-build"
brew "rust"
brew "ssh-copy-id"
brew "telnet"
brew "tmux"
brew "tokei"
brew "tree"
brew "watchman"
brew "webkit2png"
brew "yarn"
brew "z"
brew "zopfli"
brew "zsh-history-substring-search"

## Install some CTF tools; see https://github.com/ctfs/write-ups.
# brew "aircrack-ng"
# brew "bfg"
# brew "binutils"
# brew "binwalk"
# brew "cifer"
# brew "dex2jar"
# brew "dns2tcp"
# brew "fcrackzip"
# brew "foremost"
# brew "hashpump"
# brew "hydra"
# brew "john"
# brew "knock"
# brew "netpbm"
# brew "pngcheck"
# brew "socat"
# brew "sqlmap"
# brew "tcpflow"
# brew "tcpreplay"
# brew "tcptrace"
# brew "ucspi-tcp # `tcpserver` etc."
# brew "xz"

cask "caskroom/fonts/font-hack-nerd-font"
cask "spotify"
cask "suspicious-package"
cask "the-unarchiver"
cask "transmission"
cask "virtualbox"
cask "vlc"
cask "adoptopenjdk13"
# cask "vscodium"

## Install developer friendly quick look plugins; see https://github.com/sindresorhus/quick-look-plugins
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "qlprettypatch"
cask "quicklook-csv"
cask "betterzip"
cask "qlimagesize"
cask "webpquicklook"
cask "quicklookase"
cask "qlvideo"
# cask "lulu"
